performance/pdfTest.yml
config:
  target: '{{ $processEnvironment.FORM_API_SERVER_URL }}'
  phases:
    - duration:
      arrivalCount: 1
scenarios:
  - name: 'Generate PDF'
    flow:
      - log: "Get access token"
      - post:
          url: "https://keycloak.elf79.dev/auth/realms/elf/protocol/openid-connect/token"
          headers:
            Content-Type: "application/x-www-form-urlencoded"
          form:
            username: "{{ $processEnvironment.USERNAME }}"
            password: "{{ $processEnvironment.PASSWORD }}"
            grant_type: "password"
            client_id: "www"
          capture:
            json: "$.access_token"
            as: "accessToken"
      - post:
          url: "/pdf"
          headers:
            Authorization: "Bearer {{ accessToken }}"
          json:
            {
              "submission": {
                "data": {
                  "textField": "AAA",
                  "select":  5,
                  "submit": true
                }
              },
              "webhookUrl": "http://localhost:9001/webhook",
              "formUrl": "http://localhost:4000/form/e23612c4-ec94-4124-89e2-8e6672d25876"
            }